In [5]:
import pandas
pandas.__version__

'1.5.3'

In [6]:
import pandas as pd

In [7]:
data=pd.Series([0.1, 1.24, 0.83, 2.5])
print(data)

0    0.10
1    1.24
2    0.83
3    2.50
dtype: float64

In [8]:
#massiv
data.values

array([0.1 , 1.24, 0.83, 2.5 ])

In [13]:
#index
data.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
data[1]

1.24

In [17]:
data[3]

2.5

In [18]:
#srez
data[0:2]

0    0.10
1    1.24
dtype: float64

In [40]:
data = pd.Series([0.1 , 1.24, 0.83, 2.5], index=['a', 'b', 'c', 'd'])
data

a    0.10
b    1.24
c    0.83
d    2.50
dtype: float64

In [41]:
data['b']

1.24

In [36]:
population_dist = {'Almaty': 2_000_000, 'Astana': 1_500_000, 'Shymkent': 1_000_000, 'Karagandy': 700_000}
print(population_dist)

{'Almaty': 2000000, 'Astana': 1500000, 'Shymkent': 1000000, 'Karagandy': 700000}

In [37]:
population=pd.Series(population_dist)
population

Almaty       2000000
Astana       1500000
Shymkent     1000000
Karagandy     700000
dtype: int64

In [38]:
population['Shymkent']

1000000

In [45]:
#srez
population['Almaty':'Shymkent']

Almaty      2000000
Astana      1500000
Shymkent    1000000
dtype: int64

In [ ]:
#np.Series(data.index)

In [4]:
pd.Series(10, index=[2, 4, 6, 10])

2     10
4     10
6     10
10    10
dtype: int64

In [13]:
pd.Series({2:'a', 3:'b', 5:'c'})

2    a
3    b
5    c
dtype: object

In [13]:
area_dict = {'Almaty': 50_000, 'Astana': 35_000, 'Shymkent':75000, 'Karagandy': 40_000}
area = pd.Series(area_dict)
print(area)

population_dist = {'Almaty': 2_000_000, 'Astana': 1_500_000, 'Shymkent': 1_000_000, 'Karagandy': 700_000}
population = pd.Series(population_dist)
print(population)

Almaty       50000
Astana       35000
Shymkent     75000
Karagandy    40000
dtype: int64
Almaty       2000000
Astana       1500000
Shymkent     1000000
Karagandy     700000
dtype: int64

In [14]:
#Data Frame
goroda = pd.DataFrame({'Naseleniye':population, 'Ploshad':area})
print(goroda)

           Naseleniye  Ploshad
Almaty        2000000    50000
Astana        1500000    35000
Shymkent      1000000    75000
Karagandy      700000    40000

In [30]:
goroda.index

Index(['Almaty', 'Astana', 'Shymkent', 'Karagandy'], dtype='object')

In [40]:
goroda.columns

Index(['Naseleniye', '   Ploshad'], dtype='object')

In [47]:
goroda['Ploshad']

Almaty       50000
Astana       35000
Shymkent     75000
Karagandy    40000
Name: Ploshad, dtype: int64

In [51]:
pd.DataFrame(population, columns= ['Naseleniye'])

           Naseleniye
Almaty        2000000
Astana        1500000
Shymkent      1000000
Karagandy      700000

In [54]:
data = ({'first':i, 'second':i**2} for i in range(4))
pd.DataFrame(data)

   first  second
0      0       0
1      1       1
2      2       4
3      3       9

In [59]:
pd.DataFrame([{'a':1, 'b':2}, {'b':5, 'c':0}])

     a  b    c
0  1.0  2  NaN
1  NaN  5  0.0

In [62]:
pd.DataFrame({'Naseleniye':population, 'Ploshad':area})

           Naseleniye  Ploshad
Almaty        2000000    50000
Astana        1500000    35000
Shymkent      1000000    75000
Karagandy      700000    40000

In [8]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['first','second'], index=['a', 'b', 'c'])

      first    second
a  0.113613  0.093278
b  0.296062  0.319324
c  0.229144  0.316910

In [9]:
data=pd.Series([1, np.nan, 'World', None])
print(data)

0        1
1      NaN
2    World
3     None
dtype: object

In [69]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [10]:
data[data.notnull()]

0        1
2    World
dtype: object

In [11]:
print(data)
data.dropna()

0        1
1      NaN
2    World
3     None
dtype: object

0        1
2    World
dtype: object

In [82]:
df = pd.DataFrame([[5, 2, 12], [np.nan, 5 ,None], [None, 4, 6]])
df

     0  1     2
0  5.0  2  12.0
1  NaN  5   NaN
2  NaN  4   6.0

In [77]:
df.dropna()

     0  1     2
0  5.0  2  12.0

In [78]:
df.dropna(axis='columns')

   1
0  2
1  5
2  4

In [79]:
df

     0  1     2
0  5.0  2  12.0
1  NaN  5   NaN
2  NaN  4   6.0

In [94]:
#pervıy sposob
data = pd.Series([5, np.nan, 4, None, 6], index=['a', 'b', 'c', 'd','e'])
data

a    5.0
b    NaN
c    4.0
d    NaN
e    6.0
dtype: float64

In [95]:
# vtroroy sposob
data = pd.Series([5, np.nan, 4, None, 6], index=list('abcde'))
data

a    5.0
b    NaN
c    4.0
d    NaN
e    6.0
dtype: float64

In [98]:
data.fillna(0)

a    5.0
b    0.0
c    4.0
d    0.0
e    6.0
dtype: float64

In [100]:
data.fillna(method='ffill')

a    5.0
b    5.0
c    4.0
d    4.0
e    6.0
dtype: float64

In [101]:
data.fillna(method='bfill')

a    5.0
b    4.0
c    4.0
d    6.0
e    6.0
dtype: float64

In [102]:
df

     0  1     2
0  5.0  2  12.0
1  NaN  5   NaN
2  NaN  4   6.0

In [106]:
df.fillna(method='ffill', axis=1)

     0    1     2
0  5.0  2.0  12.0
1  NaN  5.0   5.0
2  NaN  4.0   6.0

In [107]:
df.fillna(method='bfill', axis=1)

     0    1     2
0  5.0  2.0  12.0
1  5.0  5.0   NaN
2  4.0  4.0   6.0

In [108]:
df.fillna(method='ffill', axis=0)

     0  1     2
0  5.0  2  12.0
1  5.0  5  12.0
2  5.0  4   6.0

In [109]:
df.fillna(method='bfill', axis=0)

     0  1     2
0  5.0  2  12.0
1  NaN  5   6.0
2  NaN  4   6.0